[
  {"id":1,"title":"The Hebrew Hammer","year":2003,"watched_date":"2025-02-09","rating":2.0,"cover_url":"/covers/the-hebrew-hammer-2003-1.jpg","summary":null,"review_text":null},
  {"id":2,"title":"You Are So Not Invited to My Bat Mitzvah","year":2023,"watched_date":"2025-07-22","rating":4.0,"cover_url":"/covers/you-are-so-not-invited-to-my-bat-mitzvah-2023-2.jpg","summary":null,"review_text":null},
  {"id":3,"title":"Time Bandits","year":1981,"watched_date":"2025-07-27","rating":1.5,"cover_url":"/covers/time-bandits-1981-3.jpg","summary":null,"review_text":"Definitely an experience, but not really a funny one, nor an experience I'd like to have again. "},
  {"id":4,"title":"You Don't Mess with the Zohan","year":2008,"watched_date":"2025-07-29","rating":4.0,"cover_url":"/covers/you-don-t-mess-with-the-zohan-2008-4.jpg","summary":null,"review_text":"I thought this was hilarious but I have no idea who the intended audience is and I don't recommend you watch it unless you for some reason are aware of mostly-inoffensive stereotypes about Israelis, are unlikely to be offended by mostly-offensive stereotypes about Palestinians, and you like stupid comedies. "},
  {"id":5,"title":"Mad Max","year":1979,"watched_date":"2025-08-02","rating":3.5,"cover_url":"/covers/mad-max-1979-5.jpg","summary":null,"review_text":"Better than I expected. Felt like half the dialogue was unintelligible due to music playing over it or a mumbly delivery. Appreciated that it just ended when the mission was accomplished. "},
  {"id":6,"title":"Chariots of Fire","year":1981,"watched_date":"2025-08-07","rating":4.0,"cover_url":"/covers/chariots-of-fire-1981-6.jpg","summary":null,"review_text":"Didn't expect to love this, even though I'm a runner. Loved it. Found the Jewish messaging odd, though? Like: Is the contrast deliberate between the heroically-Sabbath-observant Christian and the secularized Jew? It must be.  I even agree with what I think is the message (that excellence in itself isn't a wise end), but was scratching my head trying to determine if the religious contrast was anything other than incidental or if there was something particular to Judaism and Christianity that they were attempting to communicate."},
  {"id":7,"title":"Carrie","year":1976,"watched_date":"2025-08-13","rating":2.5,"cover_url":"/covers/carrie-1976-7.jpg","summary":null,"review_text":"It was a wise decision to do away with all the journalistic interruptions of the book, but the choice to minimize the almost cosmic-horror grandness felt like a miss. Maybe there was neither the budget nor the technology for that kind of grandness in 1976?\n\n\nJohn Travolta played a totally uninspired, paper-thin “bad boy”, but I thought Sissy Spacek was a believable Carrie. \n\nRecommended if you like: iconic but not-scary horror, pre-Vietnam America, boobs, kitschy Christian oratory. "},
  {"id":8,"title":"Conan the Barbarian","year":1982,"watched_date":"2025-08-14","rating":2.0,"cover_url":"/covers/conan-the-barbarian-1982-8.jpg","summary":null,"review_text":"I think only James Earl Jones saves this film. He’s the only one who behaves like a believable cult leader from an alien alternate earth. Everybody else looks and acts precisely like a rando pulled off the street in 1981 and given pretend weapons & awkward lines. \n\nI didn’t enjoy myself but I also didn’t not enjoy myself. I liked that Arnold made noises like he was a squeezable stuffed animal version of himself. "},
  {"id":9,"title":"E.T. the Extra-Terrestrial","year":1982,"watched_date":"2025-08-16","rating":null,"cover_url":"/covers/e-t-the-extra-terrestrial-1982-9.jpg","summary":null,"review_text":"Painfully nostalgic. Probably haven’t seen this in 30+ years, and it was definitely one of the first movies I ever saw. \n\nWay better storytelling than everything else I’ve been watching lately. Just like simple, believable, classic narrative arc. \n\nI happened to get the special edition one (though it isn’t marked as such) with extra shitty CGI and the guns edited out. Kinda grossed me out. \n\n"},
  {"id":10,"title":"Master and Commander","year":2003,"watched_date":"2025-08-29","rating":5.0,"cover_url":"/covers/master-and-commander.jpg","summary":null,"review_text":"Hard for me to imagine a more plainly enjoyable movie. You've got your run-of-the-mill anarchist surgeon/British naval officer bromance, daring high-seas combat, and Pippin.\n\nWhen I first watched this 20 years ago it was the anarchist part that got me going: the surgeon Maturin as my idealized, cultured radical. He plays the cello, speaks Latin, and despises nationalism, but if hard pressed, he will stab hordes of French sailors to survive.\n\nThis time around I have specifically nautical feelings and I wanted to learn to match terms to images.  It's good for that too.\n\nI had forgotten how incredible the music is, too. I'm no classical afficianado but I credit this movie with at least getting me to take a listen."}
]
